tutorials/NonReactingPBRHeatTransfer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;


halfAngle 1;
radhalfAngle	#calc "degToRad($halfAngle)";

r1 20.5;

h1 0;
h2 1100;

y1	#calc "$r1*cos($radhalfAngle)";
pz1	#calc "$r1*sin($radhalfAngle)";
nz1	#calc "-1*$pz1";


vertices
(
   
    ($h1     0   0) // 0
    ($h1  $y1 $nz1) // 1
    ($h1  $y1 $pz1) // 2
    
    ($h2     0   0) // 3
    ($h2  $y1 $nz1) // 4
    ($h2  $y1 $pz1) // 5


);

blocks
(
    hex ( 0  1  2  0  3  4  5  3)   (41  1  2200)  simpleGrading (1 1 1)
    
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0  2  1  0)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (1  2  5  4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3  4  5  3)
        );
    }

    axis
    {
        type empty;
        faces
        (
            (0  3  3  0)
        );
    }

    back
    {
        type wedge;
        faces
        (
            (0   3  5  2)
        );
    }

    front
    {
        type wedge;
        faces
        (
            (0  1   4  3)
        );
    }
);

// ************************************************************************* //
