tutorials/NonReactingPBRHeatTransfer/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8.x
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       178159;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2200;
        startFace       178200;
    }
    outlet
    {
        type            patch;
        nFaces          41;
        startFace       180400;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       180441;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          90200;
        startFace       180441;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          90200;
        startFace       270641;
    }
)

// ************************************************************************* //
