tutorials/NonReactingPBRHeatTransfer/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // porousRegion
    {
        name    porousRegionCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.05 -1.0 -1) (1.105 1.0 1);
        }
    }
    {
        name    porousRegion;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set porousRegionCellSet;
        }
    }
    {
        name    porousBoundaryFaces; 
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.05 -1.0 -1) (1.105 1.0 1);
        }
    }   
    {       
        name    porousBoundaryFaceZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            set porousBoundaryFaces;
        }
    }   

);

// ************************************************************************* //
